import { INodeProps } from "../components/Node";

export const mainData: INodeProps[] = [
	{
		name: "المفوض العام",
		attributes: {
			size: 25,
			disableModal: true,
		},
		children: [
			{
				name: "نائب المفوض العام",
				attributes: {
					size: 18,
					department: "المفوضية العامة",
					directLead: "المفوض العام",
					qualifications: [
						"أن يكون عضواً فاعلاً في الجمعية وملماً بقوانين وأنظمة جمعية الكشاف المسلم في لبنان.",
						"أن يتمتع بالخبرة والكفاءة الإدارية والتنظيمية.",
						"أن يمتلك مهارات قيادية وقدرة على التخطيط.",
						"أن يكون لديه خبرة في تدريب الراشدين وتحديد الاحتياجات التدريبية.",
						"أن يجيد حل النزاعات ومهارات التواصل الفعّال.",
						"أن يكون على دراية بأسس التقييم والتقويم.",
					],
					role: "نائب المفوض العام هو الذراع الأيمن للمفوض العام. كما يعمل كممثل للمفوض العام في المهام التي توكل إليه، ويعمل على ضمان تنفيذ القرارات والسياسات الصادرة عن المفوضية العامة.",
				},
			},
			{
				name: "المفوض الإداري",
				attributes: {
					size: 18,
					department: "المفوضية العامة",
					directLead: "المفوض العام",
					qualifications: [
						"أن يكون عضواً فاعلاً في الجمعية وملماً بقوانين وأنظمة جمعية الكشاف المسلم في لبنان.",
						"أن يتمتع بالخبرة الإدارية والتنظيمية.",
						"أن يكون لديه مهارات عالية في التوثيق وإعداد التقارير.",
						"أن يمتلك قدرة على التواصل الفعّال مع الأعضاء والإدارات المختلفة.",
						"أن يكون دقيقاً ومنظمًا في التعامل مع الوثائق والمراسلات.",
						"أن يكون لديه خبرة في إدارة الاجتماعات وتوثيق محاضرها.",
					],
					role: "اﻟﻤﻔﻮض اﻹداري ﻫﻮ اﻟﻤﺴﺆول ﻋﻦ اﻟﺠﺎﻧﺐ اﻹداري واﻟﺘﻨﻈﻴﻤﻲ ﻟﻠﻤﻔﻮﺿﻴﺔ اﻟﻌﺎﻣﺔ. ﻳﻌﻤﻞ ﺗﺤﺖ إﺷﺮاف اﻟﻤﻔﻮض اﻟﻌﺎم، وﻳﻘﻮم ﺑﻤﻬﺎم ﺗﻮﺛﻴﻖ اﻻﺟﺘﻤﺎﻋﺎت، إدارة اﻟﻤﺮاﺳﻼت، وإﻋﺪاد اﻟﺘﻘﺎرﻳﺮ اﻹدارﻳﺔ اﻟﺴﻨﻮﻳﺔ. ﻛﻤﺎ ﻳﻠﻌﺐ دورًا ﺣﻴﻮﻳًﺎ ﻓﻲ ﺿﻤﺎن ﺗﻨﻔﻴﺬ اﻟﻘﺮارات وﺗﻌﻤﻴﻢ اﻟﻤﻌﻠﻮﻣﺎت ﻋﻠﻰ اﻟﻤﻔﻮﺿﻴﺎت اﻟﻤﺨﺘﻠﻔﺔ. ",
				},
			},
			{
				name: "مفوض المنطقة",
				attributes: {
					size: 18,
					department: "المفوضية العامة",
					directLead: "المفوض العام",
					role: "مفوضو المناطق هم المسؤولون عن إدارة وتنظيم جميع الأعمال والأنشطة الكشفية التي تعود إلى منطقتهم. يعملون تحت إشراف المفوض العام، ويقومون بتمثيل المفوضية العامة في منطقتهم، والإشراف على تنفيذ القرارات والتعاميم الصادرة عنها. كما يلعبون دوراً حيوياً في توجيه وتدريب الوحدات الكشفية، وضمان الالتزام بالمبادئ الكشفية.",
					qualifications: [
						"أن يكون عضواً فاعلاً في الجمعية وملماً بقوانين وأنظمة جمعية الكشاف المسلم في لبنان.",
						"أن يتمتع بالخبرة في العمل الكشفي والإدارة المحلية.",
						"أن يكون لديه معرفة بأساليب التدريب الكشفي وأفضل الممارسات التنظيمية.",
						"أن يمتلك مهارات القيادة والإشراف على الأنشطة والوحدات الكشفية.",
						"أن يكون قادراً على التعاون مع الجهات المختلفة داخل وخارج الجمعية.",
						"أن يتمتع بالقدرة على الإشراف على الأنشطة المحلية وتنفيذ القرارات الصادرة عن المفوضية العامة.",
					],
				},
				children: [
					{
						name: "نائب المفوض",
						attributes: {
							size: 15,
							department: "مفوضية خاصة",
							directLead: "مفوض المنطقة",
							role: "نائب المفوض هو الشخص الذي يتولى دور المفوض عند غيابه أو بتكليف منه. يعمل تحت إشراف المفوض، ويقوم بتحمل جميع الواجبات والصلاحيات التي تقع على عاتق المفوض في حال غيابه. كما يلعب دوراً مهماً في دعم المفوض في إدارة المفوضية وتنفيذ الأنشطة والبرامج الكشفية.",
							qualifications: [
								"أن يكون قد أتم الثالث والعشرين من عمره.",
								"أن يكون قد أنهى دورة قائد وحدة بنجاح.",
								"أن يكون عضواً فاعلاً في الجمعية وملماً بقوانين وأنظمة جمعية الكشاف المسلم في لبنان.",
							],
						},
					},
				],
			},
		],
	},
];
